UE/app/Models/Classification.php

	public function edt($condition){
		$data=array();
		$data = $this	->select('Classification.id,Professeur.nomProf,Professeur.prenomProf,Classification.heure_edt_debut,Classification.heure_edt_fin,Classification.jour')
										->join('Niveau','Classification.niveau = Niveau.id','inner')
										->join('Semestre','Classification.semestre = Semestre.id','inner')
										->join('Enseignement','Classification.enseignement = Enseignement.id','inner')
										->join('Professeur','Classification.prof = Professeur.id','inner')
										->where($condition)
										->findAll();
---
SELECT `Classification`.`id`, `Professeur`.`nomProf`, `Professeur`.`prenomProf`, `Classification`.`heure_edt_debut`, `Classification`.`heure_edt_fin`, `Classification`.`jour`
FROM `Classification`
INNER JOIN `Niveau` ON `Classification`.`niveau` = `Niveau`.`id`
INNER JOIN `Semestre` ON `Classification`.`semestre` = `Semestre`.`id`
INNER JOIN `Enseignement` ON `Classification`.`enseignement` = `Enseignement`.`id`
INNER JOIN `Professeur` ON `Classification`.`prof` = `Professeur`.`id`
WHERE `Classification`.`niveau` = 1
AND `Classification`.`semestre` = 1

	public function divide($condition){
		$data=array();
		$tmp			=  $this		->select('UE.nomUe, UE.id as id_ue')
										->join('Niveau','Classification.niveau = Niveau.id','inner')
										->join('Semestre','Classification.semestre = Semestre.id','inner')
										->join('Professeur','Classification.prof = Professeur.id','inner')
										->join('UE','Classification.ue = UE.id','inner')
										->join('ECUE','Classification.ecue = ECUE.id','inner')
										->distinct()
										->where($condition)
										->findAll();
		$i=0;
		foreach($tmp as $ue){
			$condition["UE.nomUe"]=$ue["nomUe"];
			$data[$i][]=$ue["id_ue"];
			$data[$i][]=$ue["nomUe"];
			$data[$i][] = $this	->select('Classification.id,ECUE.nomECUE,Classification.heure,Classification.credit,Professeur.nomProf,Professeur.prenomProf,Enseignement.type,Classification.groupe, Classification.heure_edt_debut,Classification.heure_edt_fin,jour.day as jour')
										->join('Niveau','Classification.niveau = Niveau.id','inner')
										->join('Semestre','Classification.semestre = Semestre.id','inner')
										->join('Enseignement','Classification.enseignement = Enseignement.id','inner')
										->join('Professeur','Classification.prof = Professeur.id','inner')
										->join('jour','Classification.jour = jour.id','inner')
										->join('UE','Classification.ue = UE.id','inner')
										->join('ECUE','Classification.ecue = ECUE.id','inner')
										->distinct()
										->where($condition)
										->findAll();
---
SELECT DISTINCT `UE`.`nomUe`, `UE`.`id` as `id_ue`
FROM `Classification`
INNER JOIN `Niveau` ON `Classification`.`niveau` = `Niveau`.`id`
INNER JOIN `Semestre` ON `Classification`.`semestre` = `Semestre`.`id`
INNER JOIN `Professeur` ON `Classification`.`prof` = `Professeur`.`id`
INNER JOIN `UE` ON `Classification`.`ue` = `UE`.`id`
INNER JOIN `ECUE` ON `Classification`.`ecue` = `ECUE`.`id`
WHERE `Classification`.`niveau` = 1
AND `Classification`.`semestre` = 1
SELECT DISTINCT `Classification`.`id`, `ECUE`.`nomECUE`, `Classification`.`heure`, `Classification`.`credit`, `Professeur`.`nomProf`, `Professeur`.`prenomProf`, `Enseignement`.`type`, `Classification`.`groupe`, `Classification`.`heure_edt_debut`, `Classification`.`heure_edt_fin`, `jour`.`day` as `jour`
FROM `Classification`
INNER JOIN `Niveau` ON `Classification`.`niveau` = `Niveau`.`id`
INNER JOIN `Semestre` ON `Classification`.`semestre` = `Semestre`.`id`
INNER JOIN `Enseignement` ON `Classification`.`enseignement` = `Enseignement`.`id`
INNER JOIN `Professeur` ON `Classification`.`prof` = `Professeur`.`id`
INNER JOIN `jour` ON `Classification`.`jour` = `jour`.`id`
INNER JOIN `UE` ON `Classification`.`ue` = `UE`.`id`
INNER JOIN `ECUE` ON `Classification`.`ecue` = `ECUE`.`id`
WHERE `Classification`.`niveau` = 1
AND `Classification`.`semestre` = 1
AND `UE`.`nomUe` = 'Programmation'

	public function divideWhere($condition,$like){

		$data=array();
		$tmp			=  $this		->select('UE.nomUe, UE.id as id_ue')
										->join('Niveau','Classification.niveau = Niveau.id','inner')
										->join('Semestre','Classification.semestre = Semestre.id','inner')
										->join('Professeur','Classification.prof = Professeur.id','inner')
										->join('jour','Classification.jour = jour.id','inner')
										->join('UE','Classification.ue = UE.id','inner')
										->join('ECUE','Classification.ecue = ECUE.id','inner')
										->distinct()
										->where($condition)
										->findAll();
---
SELECT DISTINCT `UE`.`nomUe`, `UE`.`id` as `id_ue`
FROM `Classification`
INNER JOIN `Niveau` ON `Classification`.`niveau` = `Niveau`.`id`
INNER JOIN `Semestre` ON `Classification`.`semestre` = `Semestre`.`id`
INNER JOIN `Professeur` ON `Classification`.`prof` = `Professeur`.`id`
INNER JOIN `jour` ON `Classification`.`jour` = `jour`.`id`
INNER JOIN `UE` ON `Classification`.`ue` = `UE`.`id`
INNER JOIN `ECUE` ON `Classification`.`ecue` = `ECUE`.`id`
WHERE `Classification`.`niveau` = 1
AND `Classification`.`semestre` = 1