UE/app/Models/Classification.php

	public function divide($condition){
		$data=array();
		$tmp			=  $this		->select('UE.nomUe, UE.id as id_ue')
										->join('Niveau','Classification.niveau = Niveau.id','inner')
										->join('Semestre','Classification.semestre = Semestre.id','inner')
										->join('Professeur','Classification.prof = Professeur.id','inner')
										->join('UE','Classification.ue = UE.id','inner')
										->join('QUE','Classification.que = QUE.id','inner')
										->distinct()
										->where($condition)
										->findAll();
		$i=0;
		foreach($tmp as $ue){
			$condition["UE.nomUe"]=$ue["nomUe"];
			$data[$i][]=$ue["id_ue"];
			$data[$i][]=$ue["nomUe"];
			$data[$i][] = $this	->select('Classification.id,QUE.nomQUE,Classification.heure,Classification.credit,Professeur.nomProf')
										->join('Niveau','Classification.niveau = Niveau.id','inner')
										->join('Semestre','Classification.semestre = Semestre.id','inner')
										->join('Professeur','Classification.prof = Professeur.id','inner')
										->join('UE','Classification.ue = UE.id','inner')
										->join('QUE','Classification.que = QUE.id','inner')
										->distinct()
										->where($condition)
										->findAll();
---
SELECT DISTINCT `Classification`.`id`, `QUE`.`nomQUE`, `Classification`.`heure`, `Classification`.`credit`, `Professeur`.`nomProf`
FROM `Classification`
INNER JOIN `Niveau` ON `Classification`.`niveau` = `Niveau`.`id`
INNER JOIN `Semestre` ON `Classification`.`semestre` = `Semestre`.`id`
INNER JOIN `Professeur` ON `Classification`.`prof` = `Professeur`.`id`
INNER JOIN `UE` ON `Classification`.`ue` = `UE`.`id`
INNER JOIN `QUE` ON `Classification`.`que` = `QUE`.`id`
WHERE `Classification`.`niveau` = 1
AND `Classification`.`semestre` = 1
AND `UE`.`nomUe` = 'Physique'