UE/app/Controllers/Back.php

	public function index()
    {
		//listAll
//		$session = \Config\Services::session();
//		$session->destroy();
		$data['data']=$this->testConnexion();
		if($data['data'] == null) {
			$url = base_url('UserController/index');
			return redirect()->to($url);
		}

		$classify = new Classification();
		$data["liste"] = $classify	->select('Classification.id , Classification.ue as id_ue')
									->join('Niveau','Classification.niveau = Niveau.id','inner')
									->join('Semestre','Classification.semestre = Semestre.id','inner')
									->join('Professeur','Classification.prof = Professeur.id','inner')
									->join('UE','Classification.ue = UE.id','inner')
									->join('ECUE','Classification.ecue = ECUE.id','inner')
									->findAll();
		$profs = new Professeur();
		$data["prof"] = $profs->select('id,nomProf,prenomProf')->findAll();
---
SELECT `id`, `nomProf`, `prenomProf`
FROM `Professeur`

    public function form()
    {
		$data['data']=$this->testConnexion();

		if($data['data'] == null) {
			$url = base_url('UserController/index');
			return redirect()->to($url);
		}
		//passer à l'ajout
		$profs = new Professeur();
		$data["prof"] = $profs->select('id,nomProf,prenomProf')->findAll();
---
SELECT `id`, `nomProf`, `prenomProf`
FROM `Professeur`