UE/app/Controllers/Back.php

    public function index(): string
    {
		//listAll
		$classify = new Classification();
		$data["liste"] = $classify	->select('Classification.id , Classification.ue as id_ue')
									->join('Niveau','Classification.niveau = Niveau.id','inner')
									->join('Semestre','Classification.semestre = Semestre.id','inner')
									->join('Professeur','Classification.prof = Professeur.id','inner')
									->join('UE','Classification.ue = UE.id','inner')
									->join('ECUE','Classification.ecue = ECUE.id','inner')
									->findAll();
---
SELECT `Classification`.`id`, `Classification`.`ue` as `id_ue`
FROM `Classification`
INNER JOIN `Niveau` ON `Classification`.`niveau` = `Niveau`.`id`
INNER JOIN `Semestre` ON `Classification`.`semestre` = `Semestre`.`id`
INNER JOIN `Professeur` ON `Classification`.`prof` = `Professeur`.`id`
INNER JOIN `UE` ON `Classification`.`ue` = `UE`.`id`
INNER JOIN `ECUE` ON `Classification`.`ecue` = `ECUE`.`id`

    public function form_search(): string
    {
		//filtrer
		$to_search = $this->request->getVar("searched");
		$champ=["Classification.id","Classification.heure","Classification.credit","Professeur.nomProf","Niveau.nomNiveau","Semestre.nomSemestre","UE.nomUe","ECUE.nomECUE"];

		foreach($champ as $c){
			$like[][$c]=$to_search;
		}

		$classify = new Classification();
		$classify	->select('Classification.id , Classification.ue as id_ue')
					->join('Niveau','Classification.niveau = Niveau.id','inner')
					->join('Semestre','Classification.semestre = Semestre.id','inner')
					->join('Professeur','Classification.prof = Professeur.id','inner')
					->join('UE','Classification.ue = UE.id','inner')
					->join('ECUE','Classification.ecue = ECUE.id','inner')
					->like($like[0]);
		foreach($like as $l){
			$classify->orLike($l);
		}
		$data["liste"] = $classify->findAll();
---
SELECT `Classification`.`id`, `Classification`.`ue` as `id_ue`
FROM `Classification`
INNER JOIN `Niveau` ON `Classification`.`niveau` = `Niveau`.`id`
INNER JOIN `Semestre` ON `Classification`.`semestre` = `Semestre`.`id`
INNER JOIN `Professeur` ON `Classification`.`prof` = `Professeur`.`id`
INNER JOIN `UE` ON `Classification`.`ue` = `UE`.`id`
INNER JOIN `ECUE` ON `Classification`.`ecue` = `ECUE`.`id`

    public function form(): string
    {
		//passer à l'ajout
		$profs = new Professeur();
		$data["prof"] = $profs->select('id,nomProf,prenomProf')->findAll();
---
SELECT `id`, `nomProf`, `prenomProf`
FROM `Professeur`