UE/app/Controllers/ProfController.php

SELECT *
FROM `grade`
SELECT COUNT(*) AS `numrows`
FROM `Professeur`
INNER JOIN `grade` ON `Professeur`.`idGrade`=`grade`.`id`
SELECT `Professeur`.*, `grade`.`nomGrade` as `nomGrade`
FROM `Professeur`
INNER JOIN `grade` ON `Professeur`.`idGrade`=`grade`.`id`
 LIMIT 5
---
    public function form_prof(){
	$s = new ConnexionService();

    $data["data"] = [
        'id' => 1,
        'nom' => "Filamatra",
        'prenom' => "Tahiry",
        'mot_de_passe' => "12345678",
        'statut' => 1
      ];

    	// $data["data"]=$s->testConnexion();
	    if($data["data"]==null){
		$url = base_url("UserController/login");
		return redirect()->to($url);
	}
	else{
	        $model = new Grade();
	        $profMod = new Professeur();
	        $data["grades"] = $model->findAll();
	        $data["profs"] = $profMod   ->select('Professeur.*, grade.nomGrade as nomGrade')
                                        ->join('grade','Professeur.idGrade=grade.id','inner')
                                        ->paginate(5);

SELECT `id`
FROM `Professeur`
---
    public function returnData(){
       	$this->response->setContentType('application/json');
	$db = new Professeur();
	$id = $db->select('id')->findAll();